#include <iostream>
#include <cmath>

// using namespace std;
#ifndef FUNCS_HPP
#define FUNCS_HPP

void task_1();
void task_2();
void task_3();
// напишите программу, которая посимвольно считывает из std::in пока не достигнет 
// потока ввода, заменяет несколько подряд идущих пробелов одним и выводит полученный
// результат в std::out 
void task_4();
int find_pow(int a);
// напишите программу вычисления целочисленного логарифма по основанию 2. На вход
// подается в первой строке Т, далее Т строк с текстом. Каждая строка состоит из
// целого положительного числа ai < 10^9. Для каждого ai требуется на отдельной строке
// такое наибольшее число р, что 2^p <= ai. Гарантируется, что ai >= 1


#endif