#include "funcs.hpp"


int main() {
    /////////////////////////////////////////////////
    float d = 3.9;
    printf("%d\n", (int)d);
    /////////////////////////////////////////////////
    int i = 10;
    i = (i += 5) + (i * 4);
    printf("i: %d\n", i);
    /////////////////////////////////////////////////
    int t = 0;
    int k = (t > 0) ? 10 : 20;
    printf("k: %d\n", k);
    /////////////////////////////////////////////////
    // стандартный ввод: 
    // int a = 0, b = 0;
    // cin >> a >> b;
    // стандартный вывод: 
    // cout << "a + b = " << a + b << endl;

    /////////////////////////////////////////////////
    // std::cout << "FIRST EXAMPLE" << endl;
    // first_example();
    // std::cout << "SECOND EXAMPLE" << endl;
    // second_example();
    /////////////////////////////////////////////////

    std::cout << power(2, 5);

    /////////////////////////////////////////////////

    return 0;
}